#---- OOP Об'єктно-орієнтоване програмування

#---Навіщо взагалі ООП

# ООП потрібне, щоб:
# описувати сутності реального світу (User, Order, Task)
# зберігати стан + поведінку разом
# масштабувати код (без хаосу)
# У бекенді 90% логіки — це класи.

#---КЛАС

#--Принцип роботи

# Клас — це шаблон (креслення).
# Обʼєкт — конкретний екземпляр цього шаблону.
# Клас описує:
# які дані є (attributes)
# які дії можна виконати (methods)

class User:
    pass

# class User — оголошення класу
# User — назва класу (CamelCase)
# pass — заглушка (порожній клас)
# Поки що клас нічого не робить.

#--- __init__ і атрибути

#-- Принцип роботи

# __init__ — це конструктор.
# Він викликається кожного разу, коли створюється обʼєкт.
# Він:
# приймає початкові дані
# зберігає їх у обʼєкті

#--Приклад коду
class User:
    def __init__(self, name: str, age: int):
        self.name = name
        self.age = age

# self — посилання на конкретний обʼєкт
# self.name — атрибут обʼєкта
# name — значення, передане при створенні
user = User("Денис", 17)

#---МЕТОДИ КЛАСУ

#--Принцип роботи

# Метод — це функція, привʼязана до обʼєкта.
# Він працює з атрибутами через self.

class User:
    def __init__(self, name, age):
        self.name = name
        self.age = age

    def greet(self):
        return f"Привіт, мене звати {self.name}"

# greet — метод
# self.name — доступ до даних обʼєкта
# метод викликається через обʼєкт
user.greet()


#--- ІНКАПСУЛЯЦІЯ (публічне vs приватне)

#--Принцип роботи

# Інкапсуляція — приховування внутрішньої логіки.
# У Python це домовленість, а не жорстке правило.

class BankAccount:
    def __init__(self, balance):
        self._balance = balance

    def get_balance(self):
        return self._balance

# _balance — “protected” (не чіпай напряму)
# доступ через метод
# контроль змін

#--- __repr__

# Python за замовчуванням показує “незрозумілу строчку”.
# __repr__ дозволяє зробити людський вигляд.

class User:
    def __init__(self, name):
        self.name = name

    def __repr__(self):
        return f"User(name={self.name})"

user = User("Денис")
print(user)
